app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.where('lower(city) LIKE lower(?) OR lower(city) LIKE lower(?)', "%#{params[:search]}%", "%#{params[:search]}%").paginate(:page => params[:page], :per_page => 8)
---
SELECT  "recipes".* FROM "recipes" WHERE (lower(city) LIKE lower('%%') OR lower(city) LIKE lower('%%')) LIMIT $1 OFFSET $2  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" WHERE (lower(city) LIKE lower('%%') OR lower(city) LIKE lower('%%'))

  def show
    @reservations = Reservation.where(recipe_id: @recipe).order('created_at DESC')
    @reviews = Review.where(recipe_id: @recipe).order('created_at DESC')
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."recipe_id" = 1 ORDER BY created_at DESC
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = 1 ORDER BY created_at DESC

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user = current_user

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "price", "description", "created_at", "updated_at", "user_id", "image", "date", "time", "street", "city", "location", "no_people") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "no_people" = $1, "date" = $2, "updated_at" = $3, "image" = $4 WHERE "recipes"."id" = $5  [["no_people", 10], ["date", "0434-03-04"], ["updated_at", 2019-06-13 19:49:33 UTC], ["image", "pizza.jpg"], ["id", 18]]

  def destroy
    @recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 2]]

    def set_recipe
      @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]