app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("first_name", "last_name", "persons", "time", "message", "user_id", "recipe_id", "created_at", "updated_at", "price", "final_price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @reservation = @recipe.reservations.new(reservation_params)
    @reservation.user_id = current_user.id
    @reservation.price = @recipe.price
    if @reservation.persons == nil || @reservation.persons == 0
      @reservation.persons = 1
    end

    @recipe.update_attributes(no_people: @recipe.no_people - @reservation.persons)

    @reservation.final_price = @reservation.persons * @recipe.price
    @reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "recipes" SET "no_people" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["no_people", 10], ["updated_at", 2019-06-13 19:57:35 UTC], ["id", 18]]
UPDATE "reservations" SET "cancel_reservation" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["cancel_reservation", true], ["updated_at", 2019-06-13 19:23:55 UTC], ["id", 17]]
---
  def cancel_reservation
    reservation = Reservation.find(params[:id])
    recipe = Recipe.find(reservation.recipe_id)
    recipe.update_attributes(no_people: recipe.no_people + reservation.persons)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "no_people" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["no_people", 1], ["updated_at", 2019-06-13 22:04:27 UTC], ["id", 1]]
UPDATE "reservations" SET "honored_reservation" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["honored_reservation", true], ["updated_at", 2019-06-13 22:04:27 UTC], ["id", 1]]
---
  def honored_reservation
    reservation = Reservation.find(params[:id])
    recipe = Recipe.find(reservation.recipe_id)
    recipe.update_attributes(no_people: recipe.no_people + reservation.persons)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_recipe
    @recipe = Recipe.find(params[:recipe_id])